CSI API ETABS v1
cAreaElm Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cAreaElm
Public Interface cAreaElm
Dim instance As cAreaElm
public interface class cAreaElm
type cAreaElm =  interface end
The cAreaElm type exposes the following members.
Methods
Name | Description
Count
GetLoadTemperature
GetLoadUniform
GetLocalAxes
GetMaterialOverwrite
GetModifiers
GetNameList
GetObj
GetOffsets
GetPoints
GetProperty
GetThickness
GetTransformationMatrix
Top
See Also
Reference
ETABSv1 Namespace